Revit 2023 API
GroupTypeId.StructuralSectionGeometry Property
 "Structural Section Geometry"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
Syntax
C#
public static ForgeTypeId StructuralSectionGeometry { get; }
Visual Basic
Public Shared ReadOnly Property StructuralSectionGeometry As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ StructuralSectionGeometry {
	ForgeTypeId^ get ();
}
See Also
GroupTypeId Class
Autodesk.Revit.DB Namespace